Autodesk.Revit.UI.Events.CanExecuteEventArgs.IsAllowedInEditMode
The value that indicates whether the command is allowed to execute in Edit Modes
Remarks:
This only checks if the command is allowed in any edit mode and setting this event will enable the command in all edit modes.
Need to improve this mechanism to return which edit mode the application is currently in so that we can only enable commands
in edit modes that need them. Refer to notes in JIRA issue REVIT-211365
Since: 2025

Autodesk.Revit.UI.Events.CanExecuteEventArgs.IsChecked
The value that indicates whether the UI associated with the Command associated with this event is in a checked state.
Since: 2020

Autodesk.Revit.UI.Events.CanExecuteEventArgs.GetSelectedCategoryIds
Gets the category ids of selected elements.
Since: 2013

Autodesk.Revit.UI.Events.CanExecuteEventArgs.CanExecute
The value that indicates whether the Command associated with this event can be executed.
Since: 2013

Autodesk.Revit.UI.Events.CanExecuteEventArgs
The event arguments used by AddInCommandBinding's CanExecute event.
Since: 2013